t545830589/TianKey/esp32_firmware/tiankey_arduino.ino
/*
 * TianKey ESP32 BLE Car Key Firmware v3.0
 * Mazda Axela - BLE NUS Car Key System
 * Single Admin Mode with Auto-Auth
 *
 * GPIO Mapping (from old boot.py):
 *   Lock:      GPIO14, LOW 200ms
 *   Unlock:    GPIO33, LOW 200ms
 *   Trunk:     GPIO4,  LOW 4000ms
 *   WindowUp:  GPIO14, LOW 4000ms (same pin as Lock)
 *   WindowDown:GPIO33, LOW 4000ms (same pin as Unlock)
 *   FindCar:   GPIO14, two lock pulses (200ms LOW, 100ms gap, 200ms LOW)
 */

#include <BLEDevice.h>
#include <BLEServer.h>
#include <BLEUtils.h>
#include <BLE2902.h>
#include <Preferences.h>
#include <esp_pm.h>
#include <esp_idf_version.h>

// ==================== PIN CONFIGURATION ====================
// From old boot.py: Lock=14, Unlock=33, Trunk=4
// WindowUp uses same pin as Lock (GPIO14)
// WindowDown uses same pin as Unlock (GPIO33)
#define PIN_LOCK        14
#define PIN_UNLOCK      33
#define PIN_TRUNK       4

// ==================== BLE NUS UUIDs ====================
#define SERVICE_UUID        "6E400001-B5A3-F393-E0A9-E50E24DCCA9E"
#define TX_CHAR_UUID        "6E400003-B5A3-F393-E0A9-E50E24DCCA9E"
#define RX_CHAR_UUID        "6E400002-B5A3-F393-E0A9-E50E24DCCA9E"

// ==================== CONSTANTS ====================
#define FIRMWARE_VERSION    "3.0"
#define DEVICE_NAME_DEFAULT "TianKey"
#define ADMIN_PWD_DEFAULT   "123456"
#define INVALID_CONN_HANDLE 0xFFFF

// Action timing (from old boot.py)
#define LOCK_PULSE_MS       200
#define TRUNK_HOLD_MS       4000
#define WINDOW_HOLD_MS      4000
#define FINDCAR_PULSE_MS    200
#define FINDCAR_GAP_MS      100

#define HEARTBEAT_TIMEOUT   60000
#define DISCONNECT_LOCK_DELAY 500

// ==================== NVS KEYS ====================
#define NVS_NAMESPACE       "tiankey"
#define NVS_ADMIN_PWD       "admin_pwd"
#define NVS_DEVICE_NAME     "dev_name"
#define NVS_SAVED_TIME      "saved_time"
#define NVS_CPU_SLEEP       "cpu_sleep"
#define NVS_FIRST_AUTH_PWD  "first_auth"

// Old keys to clean
#define NVS_OLD_ADMIN_DEV   "admin_device"
#define NVS_OLD_BORROW_CODE "borrow_code"
#define NVS_OLD_BORROW_EXP  "borrow_expiry"
#define NVS_OLD_AUTO_LOCK   "auto_lock"

// ==================== GLOBALS ====================
Preferences prefs;
BLEServer *pServer = NULL;
BLECharacteristic *pTxChar = NULL;
BLECharacteristic *pRxChar = NULL;

uint16_t connHandle = INVALID_CONN_HANDLE;
bool deviceConnected = false;
bool wasAuthenticated = false;
String adminPassword = ADMIN_PWD_DEFAULT;
String deviceName = DEVICE_NAME_DEFAULT;
uint32_t savedTime = 0;
bool cpuSleepEnabled = true;
String firstAuthPwd = "";

unsigned long lastHeartbeat = 0;

// ==================== POWER MANAGEMENT ====================
// Two independent PM locks:
//   1. cpuFreqLock  → keeps CPU at max frequency when held
//   2. noSleepLock  → prevents light sleep when held
// Both held when connected or vehicle busy → CPU runs at max, no sleep
// Both released when idle → CPU enters automatic light sleep via idle task
//
// ESP-IDF 4.x (Arduino ESP32 2.x): esp_pm_lock_acquire(handle)
// ESP-IDF 5.x (Arduino ESP32 3.x): esp_pm_lock_acquire(handle, mode)
// Conditional compilation handles both.
esp_pm_lock_t cpuFreqLock = NULL;
esp_pm_lock_t noSleepLock = NULL;
bool pmLockHeld = false;
bool pmInitOk = false;
TaskHandle_t mainTaskHandle = NULL;

// ==================== VEHICLE ACTION STATE MACHINE ====================
// Non-blocking: tracks which pin is active and when to release it
enum VehicleAction {
    ACTION_NONE,
    ACTION_LOCK_PULSE,       // 200ms pulse
    ACTION_UNLOCK_PULSE,     // 200ms pulse
    ACTION_TRUNK_HOLD,       // 4000ms hold on GPIO4
    ACTION_WINDOW_HOLD,      // 4000ms hold on GPIO14 or GPIO33
    ACTION_FINDCAR_STEP1,    // first pulse 200ms
    ACTION_FINDCAR_GAP,      // gap 100ms
    ACTION_FINDCAR_STEP2,    // second pulse 200ms
};

VehicleAction currentAction = ACTION_NONE;
unsigned long actionStartTime = 0;
bool vehicleBusy = false;
int windowHoldPin = -1;  // which pin is held for window (PIN_LOCK or PIN_UNLOCK)

// ==================== FUNCTION DECLARATIONS ====================
void loadConfig();
void cleanOldNvsKeys();
void setupPins();
void setupBLE();
void processCommand(String cmd);
void sendResponse(String msg);
void factoryReset();
uint32_t getUnixTime();
void handleDisconnect();
void releaseAllPins();
void startVehicleAction(VehicleAction action);
void updateVehicleAction();

// ==================== BLE CALLBACKS ====================
class ServerCallbacks : public BLEServerCallbacks {
    void onConnect(BLEServer *pServer, esp_ble_gatts_cb_param_t *param) {
        connHandle = param->connect.conn_id;
        deviceConnected = true;
        wasAuthenticated = false;
        lastHeartbeat = millis();
        // Acquire both PM locks — CPU max freq + no sleep
        if (!pmLockHeld && pmInitOk) {
#if ESP_IDF_VERSION_MAJOR >= 5
            esp_pm_lock_acquire(cpuFreqLock);
            esp_pm_lock_acquire(noSleepLock);
#else
            esp_pm_lock_acquire(cpuFreqLock);
            esp_pm_lock_acquire(noSleepLock);
#endif
            pmLockHeld = true;
        }
        Serial.printf("[BLE] Connected, handle=%d\n", connHandle);
        if (mainTaskHandle != NULL) xTaskNotifyGive(mainTaskHandle);
    }

    void onDisconnect(BLEServer *pServer) {
        Serial.println("[BLE] Disconnected");
        handleDisconnect();
        connHandle = INVALID_CONN_HANDLE;
        deviceConnected = false;
        wasAuthenticated = false;
        // PM lock will be released by main loop if cpuSleepEnabled && !vehicleBusy
        pServer->startAdvertising();
        Serial.println("[BLE] Advertising restarted");
        if (mainTaskHandle != NULL) xTaskNotifyGive(mainTaskHandle);
    }
};

class RxCallbacks : public BLECharacteristicCallbacks {
    void onWrite(BLECharacteristic *pCharacteristic) {
        std::string value = pCharacteristic->getValue();
        if (value.length() > 0) {
            String cmd = String(value.c_str());
            cmd.trim();
            Serial.printf("[RX] %s\n", cmd.c_str());
            processCommand(cmd);
            if (mainTaskHandle != NULL) xTaskNotifyGive(mainTaskHandle);
        }
    }
};

