t545830589/TianKey/esp32_firmware/tiankey_arduino.ino
ServerCallbacks serverCallbacks;
RxCallbacks rxCallbacks;

// ==================== SETUP ====================
void setup() {
    Serial.begin(115200);
    Serial.println("\n=== TianKey v3.0 Starting ===");

    loadConfig();
    setupPins();
    setupBLE();

    Serial.printf("Name: %s\n", deviceName.c_str());
    Serial.printf("CPU Sleep: %s\n", cpuSleepEnabled ? "ON" : "OFF");

    // ===== Power Management Configuration =====
    // Step 1: Configure automatic power management
    esp_pm_config_esp32_t pmConfig;
    pmConfig.max_freq_mhz = 240;
    pmConfig.min_freq_mhz = 80;
    pmConfig.light_sleep_enable = true;
    esp_err_t errPM = esp_pm_configure(&pmConfig);
    Serial.printf("[PM] esp_pm_configure: %s\n", errPM == ESP_OK ? "OK" : "FAIL");

    // Step 2: Create CPU frequency lock (max performance when held)
#if ESP_IDF_VERSION_MAJOR >= 5
    // ESP-IDF 5.x (Arduino ESP32 3.x)
    esp_err_t errFreq = esp_pm_lock_create(ESP_PM_CPU_FREQ_MAX, 0, "cpu_freq", &cpuFreqLock);
#else
    // ESP-IDF 4.x (Arduino ESP32 2.x)
    esp_err_t errFreq = esp_pm_lock_create(ESP_PM_CPU_FREQ_MAX, 0, "cpu_freq", &cpuFreqLock);
#endif
    Serial.printf("[PM] CPU freq lock: %s\n", errFreq == ESP_OK ? "OK" : "FAIL");

    // Step 3: Create no-sleep lock (prevent light sleep when held)
#if ESP_IDF_VERSION_MAJOR >= 5
    // ESP-IDF 5.x — ESP_PM_LIGHT_SLEEP prevents automatic light sleep
    esp_err_t errSleep = esp_pm_lock_create(ESP_PM_LIGHT_SLEEP, 0, "no_sleep", &noSleepLock);
#else
    // ESP-IDF 4.x — ESP_PM_NO_SLEEP prevents all sleep
    esp_err_t errSleep = esp_pm_lock_create(ESP_PM_NO_SLEEP, 0, "no_sleep", &noSleepLock);
#endif
    Serial.printf("[PM] No-sleep lock: %s\n", errSleep == ESP_OK ? "OK" : "FAIL");

    // pmInitOk only true if ALL three succeeded
    pmInitOk = (errPM == ESP_OK && errFreq == ESP_OK && errSleep == ESP_OK
                && cpuFreqLock != NULL && noSleepLock != NULL);
    Serial.printf("[PM] Init result: %s\n", pmInitOk ? "SUCCESS" : "FAILED");

    Serial.println("=== Setup Complete ===\n");
}

// ==================== MAIN LOOP ====================
void loop() {
    unsigned long now = millis();
    mainTaskHandle = xTaskGetCurrentTaskHandle();

    // Update vehicle action state machine (non-blocking)
    updateVehicleAction();

    // Heartbeat check
    if (deviceConnected && connHandle != INVALID_CONN_HANDLE) {
        if (now - lastHeartbeat >= HEARTBEAT_TIMEOUT) {
            pServer->disconnect(connHandle);
        }
    }

    // ===== CPU low power: two-lock mechanism =====
    bool shouldHoldLock = deviceConnected || vehicleBusy || !cpuSleepEnabled;
    if (shouldHoldLock && !pmLockHeld && pmInitOk) {
        // Acquire both locks: max freq + no sleep
#if ESP_IDF_VERSION_MAJOR >= 5
        esp_pm_lock_acquire(cpuFreqLock);
        esp_pm_lock_acquire(noSleepLock);
#else
        esp_pm_lock_acquire(cpuFreqLock);
        esp_pm_lock_acquire(noSleepLock);
#endif
        pmLockHeld = true;
    } else if (!shouldHoldLock && pmLockHeld && pmInitOk) {
        // Release both locks → idle task puts CPU into automatic light sleep
#if ESP_IDF_VERSION_MAJOR >= 5
        esp_pm_lock_release(noSleepLock);
        esp_pm_lock_release(cpuFreqLock);
#else
        esp_pm_lock_release(noSleepLock);
        esp_pm_lock_release(cpuFreqLock);
#endif
        pmLockHeld = false;
    }

    // When idle: suspend this task until BLE event wakes it
    // No fixed timeout — truly waits forever until xTaskNotifyGive
    if (!shouldHoldLock && pmInitOk) {
        ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    } else {
        vTaskDelay(pdMS_TO_TICKS(1));
    }
}

// ==================== CONFIGURATION ====================
void loadConfig() {
    prefs.begin(NVS_NAMESPACE, true);

    String loadedPwd = prefs.getString(NVS_ADMIN_PWD, ADMIN_PWD_DEFAULT);
    adminPassword = loadedPwd.length() > 0 ? loadedPwd : ADMIN_PWD_DEFAULT;

    String loadedName = prefs.getString(NVS_DEVICE_NAME, DEVICE_NAME_DEFAULT);
    deviceName = loadedName.length() > 0 ? loadedName : DEVICE_NAME_DEFAULT;

    savedTime = prefs.getUInt(NVS_SAVED_TIME, 0);
    cpuSleepEnabled = prefs.getBool(NVS_CPU_SLEEP, true);
    firstAuthPwd = prefs.getString(NVS_FIRST_AUTH_PWD, "");

    prefs.end();

    cleanOldNvsKeys();

    Serial.println("[NVS] Config loaded");
}

void cleanOldNvsKeys() {
    prefs.begin(NVS_NAMESPACE, false);
    prefs.remove(NVS_OLD_ADMIN_DEV);
    prefs.remove(NVS_OLD_BORROW_CODE);
    prefs.remove(NVS_OLD_BORROW_EXP);
    prefs.remove(NVS_OLD_AUTO_LOCK);
    prefs.end();
}

// ==================== PIN SETUP ====================
void setupPins() {
    pinMode(PIN_LOCK, OUTPUT);
    pinMode(PIN_UNLOCK, OUTPUT);
    pinMode(PIN_TRUNK, OUTPUT);

    digitalWrite(PIN_LOCK, HIGH);
    digitalWrite(PIN_UNLOCK, HIGH);
    digitalWrite(PIN_TRUNK, HIGH);

    Serial.println("[GPIO] All pins initialized HIGH (inactive)");
}

// ==================== BLE SETUP ====================
void setupBLE() {
    BLEDevice::init(deviceName.c_str());

    // Maximum TX power P9
    esp_ble_tx_power_set(ESP_BLE_PWR_TYPE_DEFAULT, ESP_PWR_LVL_P9);
    esp_ble_tx_power_set(ESP_BLE_PWR_TYPE_ADV, ESP_PWR_LVL_P9);
    esp_ble_tx_power_set(ESP_BLE_PWR_TYPE_SCAN, ESP_PWR_LVL_P9);

    pServer = BLEDevice::createServer();
    pServer->setCallbacks(&serverCallbacks);

    BLEService *pService = pServer->createService(SERVICE_UUID);

    pTxChar = pService->createCharacteristic(
        TX_CHAR_UUID,
        BLECharacteristic::PROPERTY_NOTIFY
    );
    BLE2902 *pTxDesc = new BLE2902();
    pTxDesc->setNotifications(true);
    pTxChar->addDescriptor(pTxDesc);

    pRxChar = pService->createCharacteristic(
        RX_CHAR_UUID,
        BLECharacteristic::PROPERTY_WRITE | BLECharacteristic::PROPERTY_WRITE_NR
    );
    pRxChar->setCallbacks(&rxCallbacks);

    pService->start();

    BLEAdvertising *pAdvertising = BLEDevice::getAdvertising();
    pAdvertising->addServiceUUID(SERVICE_UUID);
    pAdvertising->setScanResponse(true);
    pAdvertising->setMinPreferred(0x06);
    pAdvertising->setMinPreferred(0x12);
    BLEDevice::startAdvertising();

    Serial.println("[BLE] NUS service started, advertising...");
}

// ==================== COMMAND PROCESSOR ====================
void processCommand(String cmd) {
    if (cmd.length() == 0 || cmd[0] != '!') {
        return;
    }

    cmd.remove(0, 1);
    cmd.trim();

