t545830589/TianKey/esp32_firmware/tiankey_arduino.ino
    int spaceIdx = cmd.indexOf(' ');
    String command;
    String args = "";
    if (spaceIdx > 0) {
        command = cmd.substring(0, spaceIdx);
        args = cmd.substring(spaceIdx + 1);
        args.trim();
    } else {
        command = cmd;
    }
    command.toUpperCase();

    // ===== AUTH =====
    if (command == "AUTH") {
        int pwdEnd = args.indexOf(' ');
        if (pwdEnd < 0) {
            sendResponse("ERR");
            return;
        }
        String pwd = args.substring(0, pwdEnd);
        String timeStr = args.substring(pwdEnd + 1);
        timeStr.trim();

        uint32_t timestamp = 0;
        if (timeStr.length() > 0) {
            timestamp = strtoul(timeStr.c_str(), NULL, 10);
        }

        if (pwd == adminPassword) {
            wasAuthenticated = true;
            savedTime = timestamp - (millis() / 1000);

            if (firstAuthPwd.length() == 0) {
                firstAuthPwd = pwd;
            }

            prefs.begin(NVS_NAMESPACE, false);
            prefs.putUInt(NVS_SAVED_TIME, savedTime);
            prefs.putString(NVS_FIRST_AUTH_PWD, firstAuthPwd);
            prefs.end();

            sendResponse("OK TIME");
            Serial.printf("[AUTH] Success, time=%lu\n", timestamp);
        } else {
            wasAuthenticated = false;
            firstAuthPwd = "";
            prefs.begin(NVS_NAMESPACE, false);
            prefs.putString(NVS_FIRST_AUTH_PWD, firstAuthPwd);
            prefs.end();
            sendResponse("ERR");
            Serial.println("[AUTH] Failed");
        }
        return;
    }

    // ===== LOCK =====
    if (command == "LOCK") {
        if (vehicleBusy) { sendResponse("BUSY"); return; }
        startVehicleAction(ACTION_LOCK_PULSE);
        Serial.println("[CMD] Lock");
        return;
    }

    // ===== UNLOCK =====
    if (command == "UNLOCK") {
        if (vehicleBusy) { sendResponse("BUSY"); return; }
        startVehicleAction(ACTION_UNLOCK_PULSE);
        Serial.println("[CMD] Unlock");
        return;
    }

    // ===== FINDCAR =====
    if (command == "FINDCAR") {
        if (vehicleBusy) { sendResponse("BUSY"); return; }
        startVehicleAction(ACTION_FINDCAR_STEP1);
        Serial.println("[CMD] FindCar");
        return;
    }

    // ===== WINDOWUP (uses same pin as LOCK: GPIO14, 4000ms hold) =====
    if (command == "WINDOWUP") {
        if (vehicleBusy) { sendResponse("BUSY"); return; }
        releaseAllPins();
        currentAction = ACTION_WINDOW_HOLD;
        actionStartTime = millis();
        digitalWrite(PIN_LOCK, LOW);
        vehicleBusy = true;
        windowHoldPin = PIN_LOCK;
        Serial.println("[CMD] Window Up (GPIO14 LOW 4s)");
        return;
    }

    // ===== WINDOWDOWN (uses same pin as UNLOCK: GPIO33, 4000ms hold) =====
    if (command == "WINDOWDOWN") {
        if (vehicleBusy) { sendResponse("BUSY"); return; }
        releaseAllPins();
        currentAction = ACTION_WINDOW_HOLD;
        actionStartTime = millis();
        digitalWrite(PIN_UNLOCK, LOW);
        vehicleBusy = true;
        windowHoldPin = PIN_UNLOCK;
        Serial.println("[CMD] Window Down (GPIO33 LOW 4s)");
        return;
    }

    // ===== TRUNK =====
    if (command == "TRUNK") {
        if (vehicleBusy) { sendResponse("BUSY"); return; }
        releaseAllPins();
        currentAction = ACTION_TRUNK_HOLD;
        actionStartTime = millis();
        digitalWrite(PIN_TRUNK, LOW);
        vehicleBusy = true;
        Serial.println("[CMD] Trunk (GPIO4 LOW 4s)");
        return;
    }

    // ===== HEARTBEAT (no response) =====
    if (command == "HEARTBEAT") {
        lastHeartbeat = millis();
        return;
    }

    // ===== NAME (set and restart to apply) =====
    if (command == "NAME") {
        if (args.length() == 0) {
            sendResponse("OK NAME " + deviceName);
        } else {
            if (args.length() > 31) {
                sendResponse("ERR");
                return;
            }
            deviceName = args;
            prefs.begin(NVS_NAMESPACE, false);
            prefs.putString(NVS_DEVICE_NAME, deviceName);
            prefs.end();
            sendResponse("OK NAME " + deviceName);
            Serial.printf("[NAME] Changed to: %s, restarting...\n", deviceName.c_str());
            delay(200);
            ESP.restart();
        }
        return;
    }

    // ===== PWD =====
    if (command == "PWD") {
        int pwdSpace = args.indexOf(' ');
        if (pwdSpace < 0) {
            sendResponse("ERR");
            return;
        }
        String oldPwd = args.substring(0, pwdSpace);
        String newPwd = args.substring(pwdSpace + 1);
        newPwd.trim();

        if (oldPwd != adminPassword) {
            sendResponse("ERR");
            Serial.println("[PWD] Wrong old password");
            return;
        }
        if (newPwd.length() == 0 || newPwd.length() > 31) {
            sendResponse("ERR");
            return;
        }
        adminPassword = newPwd;
        prefs.begin(NVS_NAMESPACE, false);
        prefs.putString(NVS_ADMIN_PWD, adminPassword);
        prefs.end();
        sendResponse("OK");
        Serial.printf("[PWD] Changed successfully\n");
        return;
    }

    // ===== CPUSLEEP =====
    if (command == "CPUSLEEP") {
        if (!pmInitOk) {
            sendResponse("ERR");
            Serial.println("[CPUSLEEP] PM not initialized, reject");
            return;
        }
        if (args == "0") {
            cpuSleepEnabled = false;
            // Acquire both locks to prevent any sleep
            if (!pmLockHeld && pmInitOk) {
#if ESP_IDF_VERSION_MAJOR >= 5
                esp_pm_lock_acquire(cpuFreqLock);
                esp_pm_lock_acquire(noSleepLock);
#else
                esp_pm_lock_acquire(cpuFreqLock);
                esp_pm_lock_acquire(noSleepLock);
#endif
                pmLockHeld = true;
            }
        } else if (args == "1") {
            cpuSleepEnabled = true;
            // PM lock will be released by main loop if not connected/busy
        } else {
            sendResponse("ERR");
            return;
        }
        prefs.begin(NVS_NAMESPACE, false);
        prefs.putBool(NVS_CPU_SLEEP, cpuSleepEnabled);
        prefs.end();
        sendResponse("OK CPUSLEEP");
        Serial.printf("[CPUSLEEP] Set to %s\n", cpuSleepEnabled ? "ON" : "OFF");
        return;
    }

    // ===== CPUSLEEP? (query) =====
    if (command == "CPUSLEEP?") {
        sendResponse("CPUSLEEP:" + String(cpuSleepEnabled ? "1" : "0"));
        return;
    }

    // ===== RESET =====
    if (command == "RESET") {
        factoryReset();
        return;
    }

    Serial.printf("[CMD] Unknown: %s\n", command.c_str());
}

// ==================== RESPONSE ====================
void sendResponse(String msg) {
    if (!deviceConnected || connHandle == INVALID_CONN_HANDLE) return;
    if (!pTxChar) return;

