t545830589/TianKey/esp32_firmware/tiankey_arduino.ino
    pTxChar->setValue(msg.c_str());
    pTxChar->notify();
    Serial.printf("[TX] %s\n", msg.c_str());
}

// ==================== VEHICLE ACTION STATE MACHINE ====================

void releaseAllPins() {
    digitalWrite(PIN_LOCK, HIGH);
    digitalWrite(PIN_UNLOCK, HIGH);
    digitalWrite(PIN_TRUNK, HIGH);
    currentAction = ACTION_NONE;
    vehicleBusy = false;
    windowHoldPin = -1;
    Serial.println("[GPIO] All pins released HIGH");
}

void startVehicleAction(VehicleAction action) {
    releaseAllPins();  // Ensure previous action is fully released
    currentAction = action;
    actionStartTime = millis();
    vehicleBusy = true;

    switch (action) {
        case ACTION_LOCK_PULSE:
            digitalWrite(PIN_LOCK, LOW);
            break;
        case ACTION_UNLOCK_PULSE:
            digitalWrite(PIN_UNLOCK, LOW);
            break;
        case ACTION_TRUNK_HOLD:
            digitalWrite(PIN_TRUNK, LOW);
            break;
        case ACTION_FINDCAR_STEP1:
            digitalWrite(PIN_LOCK, LOW);
            break;
        default:
            break;
    }
}

void updateVehicleAction() {
    if (!vehicleBusy || currentAction == ACTION_NONE) return;

    unsigned long elapsed = millis() - actionStartTime;

    switch (currentAction) {
        case ACTION_LOCK_PULSE:
            if (elapsed >= LOCK_PULSE_MS) {
                digitalWrite(PIN_LOCK, HIGH);
                currentAction = ACTION_NONE;
                vehicleBusy = false;
                Serial.println("[GPIO] Lock pulse complete");
            }
            break;

        case ACTION_UNLOCK_PULSE:
            if (elapsed >= LOCK_PULSE_MS) {
                digitalWrite(PIN_UNLOCK, HIGH);
                currentAction = ACTION_NONE;
                vehicleBusy = false;
                Serial.println("[GPIO] Unlock pulse complete");
            }
            break;

        case ACTION_TRUNK_HOLD:
            if (elapsed >= TRUNK_HOLD_MS) {
                digitalWrite(PIN_TRUNK, HIGH);
                currentAction = ACTION_NONE;
                vehicleBusy = false;
                Serial.println("[GPIO] Trunk hold complete");
            }
            break;

        case ACTION_WINDOW_HOLD:
            if (elapsed >= WINDOW_HOLD_MS) {
                if (windowHoldPin == PIN_LOCK) {
                    digitalWrite(PIN_LOCK, HIGH);
                    Serial.println("[GPIO] Window Up complete");
                } else if (windowHoldPin == PIN_UNLOCK) {
                    digitalWrite(PIN_UNLOCK, HIGH);
                    Serial.println("[GPIO] Window Down complete");
                }
                currentAction = ACTION_NONE;
                vehicleBusy = false;
                windowHoldPin = -1;
            }
            break;

        case ACTION_FINDCAR_STEP1:
            if (elapsed >= FINDCAR_PULSE_MS) {
                digitalWrite(PIN_LOCK, HIGH);
                currentAction = ACTION_FINDCAR_GAP;
                actionStartTime = millis();
                Serial.println("[GPIO] FindCar gap");
            }
            break;

        case ACTION_FINDCAR_GAP:
            if (elapsed >= FINDCAR_GAP_MS) {
                digitalWrite(PIN_LOCK, LOW);
                currentAction = ACTION_FINDCAR_STEP2;
                actionStartTime = millis();
                Serial.println("[GPIO] FindCar step2");
            }
            break;

        case ACTION_FINDCAR_STEP2:
            if (elapsed >= FINDCAR_PULSE_MS) {
                digitalWrite(PIN_LOCK, HIGH);
                currentAction = ACTION_NONE;
                vehicleBusy = false;
                Serial.println("[GPIO] FindCar complete");
            }
            break;

        default:
            currentAction = ACTION_NONE;
            vehicleBusy = false;
            break;
    }
}

// ==================== FACTORY RESET ====================
void factoryReset() {
    Serial.println("[RESET] Factory reset...");

    prefs.begin(NVS_NAMESPACE, false);
    prefs.clear();
    prefs.end();

    sendResponse("OK RESET");
    delay(500);
    ESP.restart();
}

// ==================== TIME ====================
uint32_t getUnixTime() {
    return (uint32_t)(millis() / 1000) + savedTime;
}

// ==================== DISCONNECT HANDLER ====================
void handleDisconnect() {
    // Release all vehicle GPIOs first
    releaseAllPins();

    // Double-lock if authenticated
    if (wasAuthenticated) {
        Serial.println("[DISC] Auto double-lock engaged");
        digitalWrite(PIN_LOCK, LOW);
        delay(LOCK_PULSE_MS);
        digitalWrite(PIN_LOCK, HIGH);
        delay(DISCONNECT_LOCK_DELAY);
        digitalWrite(PIN_LOCK, LOW);
        delay(LOCK_PULSE_MS);
        digitalWrite(PIN_LOCK, HIGH);
        Serial.println("[DISC] Double-lock complete");
    }
}
